Courses/7140/Lectures/Languages/EventDriven/index.org
# -*- mode: org -*-
#+date: 2017-02-10
#+TITLE: Event Driven Programming
#+AUTHOR: Prabhaker Mateti

#+DESCRIPTION: Mateti: OO Programming and Design 
#+HTML_LINK_HOME: ../../Top/index.html
#+HTML_LINK_UP: ../
#+HTML_HEAD: <style> P {text-align: justify} code {color: brown;} @media screen {BODY {margin: 10%} }</style>
#+BIND: org-html-preamble-format (("en" "%d | <a href=\"../../\"> ../../</a> | <a href=\"index-slides.html\"> Slides </a>"))
#+BIND: org-html-postamble-format (("en" "<hr size=1>Copyright &copy; 2017 <a href=\"http://www.wright.edu/~pmateti\">www.wright.edu/~pmateti</a> %d"))
#+STARTUP:showeverything
#+OPTIONS: toc:nil

* Abstract

Event Driven Programming. Fundamentals.  JavaFX implementations.

* Event Driven Prog

** What is an event?

1. Def is too complicated.  Ex: a key-press, a
   key-release, mouse gesture, a file changing from read-only to
   write-also, CPU becoming 95% loaded, disk being 75% vacant, ...

1. An event is /modeled/ as an instantaneous occurrence.  A real event
   that has a duration is modeled as event-begin and even-end -- ex:
   key board key-press and then key-release.

1. The discovery of events is the responsibility of the "underlying" system.

** Overview

1. Event details: source, time stamp,

1. Event Driven Prog is an important paradigm.  Independent of PLs.

1. A main loop over a table of (event --> action) pairs.

1. Classifying events, and pairing them up with actions is the even
   driven paradigm.

1. https://en.wikipedia.org/wiki/Event-driven_programming

** Actions and Listeners

1. Action is often collaborative among several event handlers
   listening to the event.

1. The (event --> action) becomes (event e --> send-to-listeners(e))

** Complications

1. What is the time gap /tg/ between an event happening, and the begin of
   an action?

1. In this tg can more events happen?

1. Can events happen concurrently?

1. Can we listen to events happening in remote systems?

1. Can actions be executed concurrently?

** JavaFX

1. Java8 + JavaFX actions are typically written as Lambda Expressions.

2. [[../Java8/JavaFX-EventDrivenProgramming-stonybrook.pdf]]
   Event-Driven Programming in JavaFX, slides, SUNY Stonybrook 2015;
   includes src code of examples

   1. Explains Anonymous Classes
   2. Explains Inner Classes
   3. Explains Lambda Expressions

1. http://gluonhq.com/labs/javafxports/ JavaFX on Mobile (Android +
   iOS). Open Source.

** Agents

1. Meyers book, Chapter 18: [[./17_agents.pdf][PDF]] high-level intro to Event-driven
   design, slides, not JavaFX.

* Game of Life

1. [[../Examples/Game-Of-Life/index.org][Game-Of-Life, Redo]] updated to include event-driven

* References


1. https://www.cs.rit.edu/~csci242/Lectures/14/Event-diagrams.pdf Java
   GUIs in JavaFX. 2015.  Recommended Reading.

* End
# Local variables:
# after-save-hook: org-html-export-to-html
# end:
