Courses/7140/Lectures/Languages/EventDriven/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Event Driven Programming</title>
<!-- 2017-02-15 Wed 05:38 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="Mateti: OO Programming and Design"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
2017-02-10 | <a href="../../"> ../../</a> | <a href="index-slides.html"> Slides </a>
</div>
<div id="content">
<h1 class="title">Event Driven Programming</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Abstract</h2>
<div class="outline-text-2" id="text-1">
<p>
Event Driven Programming. Fundamentals.  JavaFX implementations.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Event Driven Prog</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> What is an event?</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Def is too complicated.  Ex: a key-press, a
key-release, mouse gesture, a file changing from read-only to
write-also, CPU becoming 95% loaded, disk being 75% vacant, &#x2026;
</li>

<li>An event is <i>modeled</i> as an instantaneous occurrence.  A real event
that has a duration is modeled as event-begin and even-end &#x2013; ex:
key board key-press and then key-release.
</li>

<li>The discovery of events is the responsibility of the "underlying" system.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Overview</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>Event details: source, time stamp,
</li>

<li>Event Driven Prog is an important paradigm.  Independent of PLs.
</li>

<li>A main loop over a table of (event &#x2013;&gt; action) pairs.
</li>

<li>Classifying events, and pairing them up with actions is the even
driven paradigm.
</li>

<li><a href="https://en.wikipedia.org/wiki/Event-driven_programming">https://en.wikipedia.org/wiki/Event-driven_programming</a>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Actions and Listeners</h3>
<div class="outline-text-3" id="text-2-3">
<ol class="org-ol">
<li>Action is often collaborative among several event handlers
listening to the event.
</li>

<li>The (event &#x2013;&gt; action) becomes (event e &#x2013;&gt; send-to-listeners(e))
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Complications</h3>
<div class="outline-text-3" id="text-2-4">
<ol class="org-ol">
<li>What is the time gap <i>tg</i> between an event happening, and the begin of
an action?
</li>

<li>In this tg can more events happen?
</li>

<li>Can events happen concurrently?
</li>

<li>Can we listen to events happening in remote systems?
</li>

<li>Can actions be executed concurrently?
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> JavaFX</h3>
<div class="outline-text-3" id="text-2-5">
<ol class="org-ol">
<li>Java8 + JavaFX actions are typically written as Lambda Expressions.
</li>

<li><a href="../Java8/JavaFX-EventDrivenProgramming-stonybrook.pdf">../Java8/JavaFX-EventDrivenProgramming-stonybrook.pdf</a>
Event-Driven Programming in JavaFX, slides, SUNY Stonybrook 2015;
includes src code of examples

<ol class="org-ol">
<li>Explains Anonymous Classes
</li>
<li>Explains Inner Classes
</li>
<li>Explains Lambda Expressions
</li>
</ol>
</li>

<li><a href="http://gluonhq.com/labs/javafxports/">http://gluonhq.com/labs/javafxports/</a> JavaFX on Mobile (Android +
iOS). Open Source.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> Agents</h3>
<div class="outline-text-3" id="text-2-6">
<ol class="org-ol">
<li>Meyers book, Chapter 18: <a href="./17_agents.pdf">PDF</a> high-level intro to Event-driven
design, slides, not JavaFX.
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> GoL</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li><a href="../Examples/Game-Of-Life/index.html">Game-Of-Life, Redo</a> updated to include event-driven
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> References</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li><a href="https://www.cs.rit.edu/~csci242/Lectures/14/Event-diagrams.pdf">https://www.cs.rit.edu/~csci242/Lectures/14/Event-diagrams.pdf</a> Java
GUIs in JavaFX. 2015.  Recommended Reading.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> End</h2>
<div class="outline-text-2" id="text-5">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2017 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> 2017-02-10
</div>
</body>
</html>
